In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('example.csv')

In [3]:
pwd

'/Users/i523375'

In [4]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df['e'] = df['a']**2 + df['c']

In [7]:
df

    a   b   c   d    e
0   0   1   2   3    2
1   4   5   6   7   22
2   8   9  10  11   74
3  12  13  14  15  158

In [12]:
df.to_csv('exmple_with_e.csv', index=False)

In [10]:
df['txt'] = ['Almaty','Astana','Shymkent','Aqtobe']

In [11]:
df

    a   b   c   d    e       txt
0   0   1   2   3    2    Almaty
1   4   5   6   7   22    Astana
2   8   9  10  11   74  Shymkent
3  12  13  14  15  158    Aqtobe

In [15]:
df = pd.read_excel('Excel_Sample.xlsx')

In [16]:
df

   Unnamed: 0   a   b    c   d
0           0   0   1    2   3
1           1   4   5    6   7
2           2   8   9  100  11
3           3  12  13   14  15

In [21]:
df = df.reset_index()

In [22]:
df

   index  Unnamed: 0   a   b    c   d
0      0           0   0   1    2   3
1      1           1   4   5    6   7
2      2           2   8   9  100  11
3      3           3  12  13   14  15

In [24]:
df.columns

Index(['index', 'Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [25]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [27]:
df.drop(columns=['index'],inplace=True)

In [28]:
df

    a   b    c   d
0   0   1    2   3
1   4   5    6   7
2   8   9  100  11
3  12  13   14  15

In [33]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet2')

In [34]:
df

      Name  Age  Height
0    Timur   40     180
1    Ainur   30     170
2  Nurzhan   20     130
3   Dinara   24     150
4  Madiyar    5      20

In [39]:
df[df['Age']>20]['Permit'] = 'YES'

SyntaxError: invalid syntax (<ipython-input-39-1d2b61477c81>, line 1)

In [36]:
df

      Name  Age  Height
0    Timur   40     180
1    Ainur   30     170
2  Nurzhan   20     130
3   Dinara   24     150
4  Madiyar    5      20

In [47]:
df['Permit'] = df['Age']>20

In [48]:
df

      Name  Age  Height  Permit
0    Timur   40     180    True
1    Ainur   30     170    True
2  Nurzhan   20     130   False
3   Dinara   24     150    True
4  Madiyar    5      20   False

In [66]:
df['Permit1'] = [('No','Yes')[i] for i in df['Permit']]

In [67]:
df

      Name  Age  Height  Permit Permit1
0    Timur   40     180    True     Yes
1    Ainur   30     170    True     Yes
2  Nurzhan   20     130   False      No
3   Dinara   24     150    True     Yes
4  Madiyar    5      20   False      No

In [69]:
df.to_excel('My_new_excel_file.xlsx', index=False)

In [70]:
from sqlalchemy import create_engine

In [71]:
engine = create_engine('sqlite:///:memory:')

In [72]:
df.to_sql('data', engine)

In [73]:
sql_df = pd.read_sql('select * from data where Age>20', con=engine)

In [74]:
sql_df

   index    Name  Age  Height  Permit Permit1
0      0   Timur   40     180       1     Yes
1      1   Ainur   30     170       1     Yes
2      3  Dinara   24     150       1     Yes